"(Not You?)|Login - Clickable text letting user log in as a different user" = "(ไม่ใช่คุณใช่ไหม?)";

"+%i|Very short string used in place of X names of members of a thread (when the thread name is too long to fit). Ex: +1, +2, +3.  If the language has no short way to express this, use … (ellipsis) or equivalent." = "+%1$i";

",|Punctuation (comma) used to separate entries in a list of names. Example: Alice, Bob, Carol" = ",";

"1 Friend Nearby|Title of mini-megaphone inside chat bar." = "เพื่อน 1 คนอยู่ใกล้เคียง";

"1 day|text to show user was online/active 1 day ago (don't abbrev)" = "1 วัน";

"1 hour|text to show user was online/active 1 hour ago (don't abbrev)" = "1 ชั่วโมง";

"1 minute|text to show user was online/active 1 minute ago (don't abbrev)" = "1 นาที";

"1d|short indicator that a user was active 1 day ago" = "1 วัน";

"1h|short indicator that a user was active 1 hour ago" = "1 ชม.";

"1m Limit: Release to send|notify user that the maximum recording time has been reached" = "ถึง 1 นาทีแล้ว: ปล่อยเพื่อส่ง";

"1m|short indicator that a user was active 1 minute ago" = "1 นาที";

"2 days|text to show user was online/active 2 days ago (don't abbrev)" = "2 วัน";

"2 hours|text to show user was online/active 2 hours ago (don't abbrev)" = "2 ชั่วโมง";

"2 minutes|text to show user was online/active 2 minutes ago (don't abbrev)" = "2 นาที";

"A new version of Messenger is available.|New version title" = "มี Messenger เวอร์ชันใหม่ให้บริการ";

"Activation Code|placeholder text for activation code field" = "รหัสเปิดใช้งาน";

"Activation Request Failed|" = "คำขอเปิดใช้งานล้มเหลว";

"Active Now (%d)|Title for chat bar section containing online friends who are not top friends. Number after string is number of friends who are online." = "ใช้งานอยู่ในขณะนี้ (%1$d)";

"Add Favorite|Title of screen shown when user is adding a new favorite" = "เพิ่มรายการโปรด";

"Add More People|button for adding people to the conversation" = "เพิ่มบุคคลอีก";

"Add More People|title for add members page" = "เพิ่มบุคคลอีก";

"Add More People|title for add people page" = "เพิ่มบุคคลอีก";

"Add People|button to add members to the message thread" = "เพิ่มบุคคล";

"Add Photos|Button label for adding photos from the photo library" = "เพิ่มรูปภาพ";

"Add to Existing Contact|action sheet option for adding a phone number to an existing contact" = "เพิ่มในผู้ติดต่อที่มีอยู่";

"Adding...|adding progress text" = "กำลังเพิ่ม...";

"Advanced Settings|text for advanced settings button" = "การตั้งค่าขั้นสูง";

"Advanced|title for advanced settings page" = "ขั้นสูง";

"Alerts Off Until %@|Indicates that alerts are off until X time" = "ปิดการเตือนจนถึง %1$@";

"Alerts Off for 1 Hour|Indicates that alerts are off for 1 hour" = "ปิดการเตือน 1 ชั่วโมง";

"Alerts Off|Indicates that alerts are off" = "ปิดการเตือน";

"Alerts On|Indicates that alerts are on" = "เปิดการเตือน";

"All notifications are off for 8h.|footer text for notifications settings applying to all conversations" = "การแจ้งเตือนทั้งหมดจะปิดเป็นเวลา 8 ชม.";

"All notifications are off.|Mute warning display on thread list" = "การแจ้งเตือนทั้งหมดปิดอยู่";

"All|Segment button label for all stickers" = "ทั้งหมด";

"Answer|Text for button that accepts a call" = "รับสาย";

"Archive|Button label that will archive the conversation" = "เก็บถาวร";

"Archive|Label for archive button when swipe to archive in thread list view" = "เก็บถาวร";

"Are you sure you want to delete the conversation name?|alert message for deleting conversation name" = "คุณแน่ใจหรือไม่ว่าคุณต้องการลบชื่อการสนทนานี้?";

"Are you sure you want to leave this conversation? You will no longer receive new messages.|confirmation dialog message for leaving a thread" = "คุณแน่ใจหรือไม่ว่าคุณต้องการออกจากการสนทนานี้ คุณจะไม่ได้รับข้อความใหม่อีกต่อไป";

"Are you sure?|Title for dialog asking the user if they're sure if they want to not enable push notifications" = "คุณแน่ใจหรือไม่?";

"Attach a Photo|Button label for attaching a photo from the photo library" = "แนบรูปภาพ";

"Attach media|Accessibility text for button that lets user start attaching photos or other media, as well as emoticons and emoji" = "แนบสื่อ";

"Back|Go back to previous screen" = "ย้อนกลับ";

"Back|generic nav bar back button" = "ย้อนกลับ";

"Background task expired|Error string for app killed in background while message was sending" = "งานที่ทำอยู่เบื้องหลังหมดอายุแล้ว";

"Bing Image Search|" = "ค้นหารูปภาพขนาดใหญ่";

"Blast to at most %i people at a time.|dialog message for when the user tries to select too many recipients for a blast message. A blast message goes to multiple individual recipients who cannot reply-all." = "สามารถกระจายข่าวไปยังผู้คนได้สูงสุด %1$i คนพร้อมกัน";

"Blast|Button for starting a blast (broadcast) message. A blast message goes to multiple individual recipients who cannot reply-all." = "กระจายข่าว";

"Blast|Title of the blast (broadcast) composer screen. A blast message goes to multiple individual recipients who cannot reply-all." = "กระจายข่าว";

"Blasts can contain up to %i attachments.|dialog message for when the user tries to add too many (>5) attachments to a message" = "การประกาศสามารถมีเอกสารแนบได้สูงสุดถึง %1$i รายการ";

"Bring messages to life|Title of Media attachment NUX" = "ทำให้ข้อความมีชีวิตชีวา";

"Broadcast|Button for starting a broadcast message. A broadcast message goes to multiple individual recipients who cannot reply-all." = "กระจายข่าว";

"Broadcast|Title of the broadcast composer screen. A broadcast message goes to multiple individual recipients who cannot reply-all." = "กระจายข่าว";

"Call Ended|End call message in non-error case" = "วางสายแล้ว";

"Call Ended|String shown when the call ends" = "วางสายแล้ว";

"Call Failed|End call message in error case" = "ไม่สามารถโทรได้";

"Call friends over your Wi-Fi connection or mobile network. Normal data rates apply.|Warning about data usage" = "โทรถึงเพื่อผ่านเครือข่าย Wi-Fi หรือเครือข่ายโทรศัพท์มือถือ คิดตามอัตราค่าบริการข้อมูลปกติ";

"Call %@|action sheet option for calling a phone number" = "โทรถึง %1$@";

"Call|Call" = "โทร";

"Calls are free over Wi-Fi. Standard charges apply for calls over a mobile network.|Alert message that warns users their mobile carrier may charge them for making VOIP calls" = "สามารถโทรฟรีผ่าน Wi-Fi ได้ มีค่าบริการมาตรฐานสำหรับการโทรผ่านเครือข่ายโทรศัพท์มือถือ";

"Camera|Button label for attaching a photo from the camera" = "กล้อง";

"Cancel|Title for generic Cancel button." = "ยกเลิก";

"Celebrations|Title of list of friends who have events to celebrate." = "งานฉลอง";

"Chat with any contact or number on your phone without any costs.|Explanation of why one should use the contact importer" = "แชทกับผู้ติดต่อหรือหมายเลขบนโทรศัพท์ของคุณโดยไม่ต้องเสียค่าใช้จ่าย";

"Chat|The title of the view showing the buddy list section of the app" = "การแชท";

"Choose Friends|Button title for adding friends to the broadcast recipients list." = "เลือกเพื่อน";

"Choose Photo|action sheet option for choosing a photo from photo library" = "เลือกรูปภาพ";

"Clear|prompt to clear all unsent messages" = "ล้าง";

"Clearing...|Progress text shown while clearing the image for a thread" = "กำลังล้าง...";

"Close active chat|Button to close an active chat" = "ปิดการแชทที่สนทนาอยู่";

"Close|Title of button in navigation bar to close a web page." = "ปิด";

"Closes settings|Accessibility hint for \"Done\" button, tapping on it will close the settings panel" = "ปิดการตั้งค่า";

"Comment|Comment button title" = "แสดงความคิดเห็น";

"Compose message to %@|Accessibility label describing a text view to start writing a message to a user with no draft message" = "เขียนข้อความถึง %1$@";

"Compose message to %@: %@|Accessibility label describing a text view to start writing a message to a user with some appended draft message" = "เขียนข้อความถึง %1$@: %2$@";

"Confirm Phone|Title of page where user enters their phone number" = "ยืนยันหมายเลข";

"Connecting|Text shown on call screen while connecting a call" = "กำลังเชื่อมต่อ";

"Connection Failed|Alert title when connection failed" = "การเชื่อมต่อล้มเหลว";

"Connection Lost|End call message in connection lost case" = "การเชื่อมต่อขาดหาย";

"Contact Info|AXLabel for button to go from Message to Recipient's contact info." = "ข้อมูลติดต่อ";

"Contact Info|Title of the canonical thread info page." = "ข้อมูลติดต่อ";

"Continue and Don't Ask Again|Button label to not ask for permission again before continuing through a zero rating session fence" = "ดำเนินการต่อและไม่ต้องถามอีก";

"Continue|Button label to continue through zero rating session fence" = "ดำเนินการต่อ";

"Continue|Login - Login Button Title for Keychain Login" = "ทำต่อ";

"Conversation Name|placeholder text in conversation name textfield" = "ชื่อการสนทนา";

"Copy|Option that pops out after long press on a link/phone no./address in message thread." = "คัดลอก";

"Copy|Title for buttons and menus that let user copy the current text" = "คัดลอก";

"Copy|action sheet option for copying a string to the clipboard" = "คัดลอก";

"Could not add new members. Please try again.|message for failing to add members dialog" = "ไม่สามารถเพิ่มสมาชิกใหม่ โปรดลองอีกครั้ง";

"Could not load sticker store.|Error message for sticker store load failure" = "ไม่สามารถโหลด Sticker Store ได้";

"Could not retrieve availability|Text shown to an user when the operation to retrieve the other party's callable status fails" = "ไม่สามารถเรียกดูสถานะได้";

"Countries|Title for country picker" = "ประเทศ";

"Country|Country - Country placeholder text" = "ประเทศ";

"Create Group Chat|Label for a button that creates a new group chat" = "สร้างการแชทกลุ่ม";

"Create Group Chat...|Text on a button to compose a new group message" = "สร้างการแชทกลุ่ม...";

"Create Group Conversation|button for adding people to the canonical conversation" = "สร้างกลุ่มการสนทนา";

"Create New Contact|action sheet option for creating a new contact" = "สร้างผู้ติดต่อใหม่";

"Currently in a call|Error message when user tries to initiate a call while already in a call" = "กำลังอยู่ในสายในขณะนี้";

"Customize Notification Settings|User education for how to configure conversation alerts" = "ปรับการตั้งค่าการแจ้งเตือนให้เหมาะสม";

"Decline|Text for button that declines a call" = "ปฏิเสธ";

"Delete Conversation Name|alert title for deleting conversation name" = "ลบชื่อการสนทนา";

"Delete Conversation|Button label that will delete the conversation" = "ลบการสนทนา";

"Delete Message? It cannot be undone.|text shown when a user swipes to delete a message" = "ต้องการลบข้อความ? คุณจะไม่สามารถยกเลิกการกระทำนี้ได้";

"Delete This Entire Conversation?|Title for the Confirm alert box asking the user if they want to delete a conversation." = "ลบการสนทนาทั้งหมดนี้หรือไม่";

"Delete|Button label that will delete the conversation" = "ลบ";

"Delete|Button to accept deleting the name of a conversation" = "ลบ";

"Delete|Label for archive button when swipe to archive in thread list view" = "ลบ";

"Delete|Label for button to delete previous character" = "ลบ";

"Delete|Label on button that deletes a thread" = "ลบ";

"Delete|button text for deleting a message" = "ลบ";

"Delete|button text for removing an unsent message" = "ลบ";

"Details|title for message details page" = "รายละเอียด";

"Discover Who's Nearby|Title of NUX to encourage user to use location services." = "ค้นพบว่าใครอยู่ใกล้เคียง";

"Don't Delete|Button to decline to delete the name of a conversation" = "ไม่ต้องลบ";

"Don't Save|Don't save action sheet button" = "ไม่ต้องบันทึก";

"Done editing message list|Accessibility label for button that ends editing of the messages list" = "แก้ไขรายการข้อความเรียบร้อยแล้ว";

"Done|Title for generic Done button that dismisses a view. This needs to be a short string to avoid truncation." = "เรียบร้อย";

"Double-tap to edit|Accessibility hint for FAVORITES header in Chat friend list" = "แตะสองครั้งเพื่อแก้ไข";

"Download Failed|Title in alert view when downloading a sticker pack has failed" = "ดาวน์โหลดล้มเหลว";

"Download|Accessibility label for download button in sticker store list view" = "ดาวน์โหลด";

"Download|Button title to download an upgrade" = "ดาวน์โหลด";

"Download|Label for button to download a sticker pack" = "ดาวน์โหลด";

"Downloaded|Accessibility label for downloaded icon in sticker store list view" = "ดาวน์โหลดแล้ว";

"Downloaded|Label for button to show a sticker pack has been downloaded" = "ดาวน์โหลดแล้ว";

"Downloading|Accessibility label for download button in sticker store list view when downloading" = "กำลังดาวน์โหลด";

"Downloading|Label for button to show a sticker pack being downloaded" = "กำลังดาวน์โหลด";

"Drag Down to Hide|Chat head dismiss NUX title" = "ลากลงเพื่อซ่อน";

"Drag here to hide|instructions for user to drag a chat head to hide it" = "ลากมาที่นี่เพื่อซ่อน";

"Edit|Edit button/label title for chat divebar" = "แก้ไข";

"Email or phone number|email/phone field placeholder on login screen" = "อีเมลหรือหมายเลขโทรศัพท์";

"Empty Feedback|Title for empty feedback warning." = "คำติชมว่าง";

"Enable|Enable Message Anyone, keep it short, 14 chars max" = "เปิดใช้งาน";

"Enter Code|Enter Code page title" = "ป้อนรหัส";

"Error|Error title for sticker pack detail view" = "ข้อผิดพลาด";

"Error|error title after failed to load webview" = "ข้อผิดพลาด";

"FREE|Price label for free sticker pack" = "ฟรี";

"Facebook Is Better With Location|Title of NUX to encourage user to use location services." = "Facebook สนุกกว่าด้วยตำแหน่งที่ตั้ง";

"Facebook Messenger Login|Accessibility label for header of messenger login view" = "เข้าสู่ระบบ Facebook Messenger";

"Facebook User|Placeholder name for Facebook user whose name is unknown" = "ผู้ใช้ Facebook";

"Facebook stores contacts on your behalf and may use them to help others to search for or connect with people, or to generate suggestions for you or others. You can edit this information by tapping the \"i\" button in a conversation, or delete all your contacts in your app settings.|Detailed explanation of the contact sync feature on the Learn More screen" = "Facebook จะจัดเก็บรายชื่อผู้ติดต่อของคุณแทนคุณและอาจนำไปใช้เพื่อช่วยผู้อื่นค้นหาหรือเชื่อมต่อกับผู้คนหรือเพื่อสร้างการแนะนำให้คุณหรือผู้อื่น คุณสามารถแก้ไขข้อมูลนี้ได้โดยการแตะที่ปุ่ม \"i\" ในการสนทนา หรือลบรายชื่อผู้ติดต่อทั้งหมดของคุณในการตั้งค่าแอพ";

"Facebook will periodically use and store your location.|Explanation to let user know Facebook will periodically use and store his location." = "Facebook จะใช้และจัดเก็บตำแหน่งที่ตั้งของคุณเป็นระยะๆ";

"Failed to add members|title for failing to add members dialog" = "เพิ่มสมาชิกไม่สำเร็จ";

"Failed to save your settings.|error message after changing thread alert setting." = "บันทึกการตั้งค่าของคุณไม่สำเร็จ";

"Favorites|chat bar favorites header title" = "รายการโปรด";

"Featured|Segment button label for featured stickers" = "แนะนำ";

"Follow these steps to use Facebook's location features.|Explanation to let user know he can turn on location services by following the listed steps." = "ทำตามขั้นตอนเหล่านี้เพื่อใช้คุณสมบัติตำแหน่งที่ตั้งของ Facebook";

"Follow|Title for button allowing users to follow the profile they are currently viewing" = "ติดตาม";

"For more accurate results, go to %@ settings and choose Location Services. Select ON for %@.|Error explanation when location services are unavailable, and user gets better results with them on. {name1} is the name of the current device, e.g. iPhone; {name2} is the app name." = "สำหรับผลลัพธ์ที่ถูกต้องยิ่งขึ้น ไปที่การตั้งค่า %1$@ แล้วเลือกบริการตำแหน่งที่ตั้ง เลือก เปิด สำหรับ %2$@";

"For more accurate results, go to %@ settings and tap Privacy, then Location Services. Select ON for %@.|Error explanation when location services are unavailable, and user gets better results with them on. {name1} is the name of the current device, e.g. iPhone; {name2} is the app name." = "สำหรับผลลัพธ์ที่ถูกต้องยิ่งขึ้น ไปที่การตั้งค่า %1$@ แล้วแตะ ความเป็นส่วนตัว จากนั้น บริการตำแหน่งที่ตั้ง เลือก เปิด สำหรับ %2$@";

"Free Call|Text on button that starts a messenger call" = "โทรฟรี";

"Free Calling Unavailable|Title for dialog explaining that messenger calls are not available" = "ไม่สามารถโทรฟรีได้";

"Friends Nearby|Title of list of friends who are nearby." = "เพื่อนที่อยู่ใกล้เคียง";

"Friends on Messenger|Table title: Friends who have Facebook Messenger" = "เพื่อนใน Messenger";

"Get Directions|action sheet option for viewing a map" = "รับเส้นทาง";

"Get Facebook Messenger|The title for messenger promotion banner" = "โหลด Facebook Messenger";

"Get Started|Label for a button that creates a new group chat" = "เริ่มต้น";

"Get Started|Title for NUX" = "เริ่ม";

"Give us feedback or report a problem|Placeholder text for the report bug or feedback input field" = "ส่งคำติชมมาให้เราหรือรายงานปัญหา";

"Google Image Search|" = "ค้นหารูปภาพใน Google";

"Group Chat|Title for megaphone section helping users discover group chats" = "การแชทกลุ่ม";

"Group Chats|Title for megaphone section helping users discover group chats" = "การแชทกลุ่ม";

"Group Chats|chat bar header for group conversations" = "การแชทกลุ่ม";

"Group Conversation|Label at top of online friends list that takes user to new message composer" = "การสนทนาแบบกลุ่ม";

"Group Conversations|Table header for group threads section" = "การสนทนากลุ่ม";

"Group Info|Title of group thread info page." = "ข้อมูลกลุ่ม";

"Group Members|Title for section showing members of a group (member count will follow)" = "สมาชิกในกลุ่ม";

"Group Messages|Title for megaphone section helping users discover group chats" = "ข้อความกลุ่ม";

"Group|Button for starting a new group message." = "กลุ่ม";

"Have a conversation with a bunch of friends at a time.|Body text for megaphone encourgaging users to try group chats" = "สนทนากับกลุ่มเพื่อนพร้อมๆ กัน";

"Help|text for help button" = "วิธีใช้";

"Hold to Talk|The instruction for holding the record button and talk" = "กดค้างเพื่อพูด";

"I'm sure|Button label confirming the user wants to continue with the selected action" = "ฉันแน่ใจ";

"If you enjoy using %@, would you mind taking a moment to rate this update? Thanks!|Prompt for user to rate the app." = "หากคุณชอบใช้ %1$@ ช่วยสละเวลาเล็กน้อยเพื่อให้คะแนนการอัพเดตนี้ได้ไหม ขอบคุณ!";

"Image Search|action sheet option for choosing a photo from image search" = "การค้นหารูปภาพ";

"Include your location|Title of location NUX when user has not yet made a choice regarding enabling or disabling location services." = "ใส่ตำแหน่งที่ตั้งของคุณ";

"Incorrect Confirmation Code.|alert title for incorrect confirmation code" = "รหัสยืนยันไม่ถูกต้อง";

"Install Facebook Messenger?|The caption to promote users for installing Facebook Messenger app" = "ต้องการติดตั้ง Facebook Messenger ใช่หรือไม่";

"Install|Button text to install the Facebook Messenger" = "ติดตั้ง";

"Install|The text on the button for users to install Messenger." = "ติดตั้ง";

"Introducing Chat Heads|Chat head intro NUX title" = "ขอแนะนำ Chat Heads";

"Invalid Country Code|alert title for invalid country code" = "รหัสประเทศไม่ถูกต้อง";

"Invalid Phone Number|alert title for invalid phone number" = "หมายเลขโทรศัพท์ไม่ถูกต้อง";

"Just tap to open and close your messages.|Chat head intro NUX body" = "เพียงแตะเพื่อเปิดและปิดข้อความของคุณ";

"Keep everyone in the loop|Detail subtitle for Group Chat NUX slide" = "ให้ทุกคนอยู่ในลูป";

"Last Updated: %@|last updated date in pull to refresh header" = "อัพเดตล่าสุด: %1$@";

"Learn More|Default action text for more info link on the zero rating promotion banner view at the bottom of screen." = "เรียนรู้เพิ่มเติม";

"Learn More|Learn More about Message Anyone, keep it short, 14 chars max" = "เรียนรู้เพิ่มเติม";

"Leave Conversation|leave conversation button" = "ออกจากการสนทนา";

"Leave conversation?|confirmation dialog title for leaving a thread" = "ออกจากการสนทนาหรือไม่";

"Leave|Button title for leaving a thread" = "ออก";

"Leaving...|Progress text shown while leaving a thread" = "กำลังออก...";

"Let people in this conversation know where you are.|Text of location NUX when user has not yet made a choice regarding enabling or disabling location services." = "อนุญาตให้บุคคลในการสนทนานี้ทราบว่าคุณอยู่ที่ไหน";

"Licenses|Licenses screen title" = "ใบอนุญาต";

"Licenses|text for licenses button" = "ใบอนุญาต";

"Like|Like button title" = "ถูกใจ";

"Like|Title for generic Like button." = "ถูกใจ";

"Load Map|Button text for users to load the map location when zero rated." = "โหลดแผนที่";

"Loading...|Message presented while waiting for content to load." = "กำลังโหลด...";

"Loading...|Placeholder text while results are loading" = "กำลังโหลด...";

"Locating You...|Message presented when waiting for an accurate location fix." = "กำลังระบุตำแหน่งของคุณ...";

"Location is Disabled|Title for dialog indicating that the app hasn't been granted location permissions" = "ตำแหน่งที่ตั้งถูกปิดใช้งาน";

"Location is off for this conversation|Title of location NUX when user turns off location services for the first time." = "ตำแหน่งที่ตั้งถูกปิดสำหรับการสนทนานี้";

"Location services are off. Turn on to let people in this conversation know where you are.|Text of location NUX when user has disabled location services." = "บริการตำแหน่งที่ตั้งปิดอยู่ เปิดเพื่อให้ผู้อื่นในการสนทนานี้ทราบว่าคุณอยู่ที่ไหน";

"Location services are on|Title of location NUX when user has enabled location services." = "บริการตำแหน่งที่ตั้งเปิดอยู่";

"Log In to Facebook|Login - Login Button Title for password login" = "เข้าสู่ระบบ Facebook";

"Logged in as %@|Login - Text showing who user is logged in as" = "เข้าสู่ระบบในชื่อ %1$@";

"Login Approval Required|title of login approval dialog" = "ต้องป้อนรหัสอนุมัติการเข้าสู่ระบบ";

"Login Failed|Invalid login alert title" = "ไม่สามารถเข้าสู่ระบบได้";

"Logs in as someone else|Accessibility hint for \"Not You?\" link on the login page, letting the user log in as some one else" = "เข้าสู่ระบบในชื่ออื่น";

"Logs in as %@|Accessibility hint for the \"Continue\" button on the login screen, which lets the user log in using the system Facebook account with one tap" = "เข้าสู่ระบบในชื่อ %1$@";

"Logs in to another account|Accessibility hint for \"Switch Account\", which lets users to log out or log in with another account" = "เข้าสู่ระบบบัญชีผู้ใช้อื่น";

"Mark as Unread|Button label that will mark the thread as unread" = "ทำเครื่องหมายว่ายังไม่ได้อ่าน";

"Meep|Name for Meep sticker pack" = "Meep";

"Message Anyone|Call to action to use contact importer in divebar" = "ส่งข้อความถึงใครก็ได้";

"Message friends|Accessibility label for button that toggles display of friends list/search" = "ส่งข้อความถึงเพื่อน";

"Message|Button for starting a new message." = "ข้อความ";

"Message|button to open a composer to send a message to the page" = "ส่งข้อความ";

"Messages|Messenger module display name" = "ข้อความ";

"Messages|The title of the message thread list view." = "ข้อความ";

"Messages|Title for messages inbox view" = "ข้อความ";

"Messages|accessibility (voiceover) label for chathead inbox" = "ข้อความ";

"Messages|name of the app with Facebook brand" = "ข้อความ";

"Messenger regularly syncs your contacts to help you reach more people and connect friends|Explanation of the contact sync feature on the Learn More screen" = "Messenger จะซิงค์รายชื่อผู้ติดต่อขของคุณอย่างสม่ำเสมอเพื่อช่วยให้คุณติดต่อกับผู้คนและเชื่อมต่อกับเพื่อนมากขึ้น";

"Messenger|The title of the app, used in Appirater's dialog." = "Messenger";

"More Friends (%d)|Title for chat bar section containing friends who are not top friends. Number after string is number of friends who are online or pushable." = "เพื่อนคนอื่นๆ (%1$d)";

"More Friends (%d)|Title for chat bar section containing online friends who are not top friends. Number after string is number of friends who are online." = "เพื่อนคนอื่นๆ (%1$d)";

"More Online Friends|Table title: More friends who are online (but are not top ranked friends)" = "เพื่อนที่ออนไลน์เพิ่มเติม";

"Name is Too Long|alert title for long conversation name" = "ชื่อยาวเกินไป";

"Name this conversation|placeholder text for the prompt to name a conversation" = "ตั้งชื่อการสนทนานี้";

"Nearby|Nearby people to send a message to" = "ใกล้เคียง";

"Never miss a message again|Detail subtitle for Push Notification NUX slide" = "ไม่พลาดทุกข้อความ";

"Never miss a message from your friends again.|Body of Messenger NUX page 2" = "คุณจะไม่พลาดข้อความจากเพื่อนอีกต่อไป";

"New Message|Text on a button in messages popover to compose a new message" = "ข้อความใหม่";

"New Message|Title of screen shown when user is composing a new message" = "ข้อความใหม่";

"New version available|Title of alert displayed when new version is available" = "มีเวอร์ชันใหม่ให้บริการ";

"Next|Generic button to move to next item" = "ถัดไป";

"Next|button label for moving to the next screen" = "ถัดไป";

"No Internet Connection|Warning banner for no network connection" = "ไม่มีการเชื่อมต่ออินเทอร์เน็ต";

"No Message|dialog title for when user tries to send an empty message" = "ไม่มีข้อความ";

"No Participants|String to display in table cell when no participants are on the thread because everyone has left the conversation" = "ไม่มีผู้เข้าร่วม";

"No Participants|String when no participants are on the thread" = "ไม่มีผู้เข้าร่วม";

"No Recipients|dialog title for when user tries to send to no recipients" = "ไม่มีผู้รับ";

"No Results|Alert title when there are no results from image search." = "ไม่พบผลลัพธ์";

"No locations shared recently.|message on map view when no location has been shared recently" = "ไม่มีตำแหน่งที่ตั้งที่แชร์เมื่อเร็วๆ นี้";

"No response.|Error reported when no response is received from the server" = "ไม่มีการตอบสนอง";

"No, Thanks|Label on button for user to decline to rate the app" = "ไม่ ขอบคุณ";

"Not Now|Button text to temporarily ignore the installation message" = "ไม่ใช่ตอนนี้";

"Not Now|Do not enable contact sync button label, 15 char max" = "ไม่ใช่ตอนนี้";

"Not Now|Not now alert popup button" = "ไม่ใช่ตอนนี้";

"Not Now|Title of button to not share location for now." = "ไม่ใช่ตอนนี้";

"Not Now|button label for deferring enabling push notifications" = "ไม่ใช่ตอนนี้";

"Not now|Button title to decline an upgrade" = "ไม่ใช่ตอนนี้";

"Notifications are turned off for 8 hours|Accessibility announcement for turning off messenger notifications for 8 hours" = "การแจ้งเตือนจะปิดเป็นเวลา 8 ชั่วโมง";

"Notifications are turned on|Accessibility announcement for turning on messenger notifications" = "การแจ้งเตือนเปิดอยู่";

"Notifications for This Conversation|Title for per-thread notification settings" = "การแจ้งเตือนสำหรับการสนทนานี้";

"Notifications for this conversation are off.|Mute warning display on conversation view" = "การแจ้งเตือนสำหรับการสนทนานี้ปิดอยู่";

"Notifications|Label for enabling/disabling notification" = "การแจ้งเตือน";

"Notifications|Label for enabling/disabling notifications" = "การแจ้งเตือน";

"OK|Title for generic OK button." = "ตกลง";

"Off Until %@|Short string for indicating that alerts are off until X time" = "ปิดจนถึง %1$@";

"Off for 1 Hour|Short string for indicating that alerts are off for 1 hour" = "ปิดเป็นเวลา 1 ชั่วโมง";

"Off|Short string for indicating that alerts are off" = "ปิด";

"On|Short string for indicating that alerts are on" = "เปิด";

"Once you delete your copy of the conversation, it cannot be undone.|Message body for the Confirm alert box asking the user if they want to delete a conversation." = "เมื่อคุณลบสำเนาการสนทนาแล้ว คุณจะไม่สามารถเลิกทำได้";

"Only You|String for describing a thread where you are the only user remaining" = "คุณเท่านั้น";

"Open iPhone Settings|One of a sequence of steps instructing user to turn on location services." = "1. เปิดการตั้งค่าของ iPhone";

"Open in Maps|action sheet option for opening an address in the Maps app" = "เปิดในแผนที่";

"Open sticker store|Accessibility label for sticker store tab bar button" = "เปิด Sticker Store";

"Other People|Table section header for a list of non-friend search results" = "บุคคลอื่น";

"Password|password field placeholder on login screen" = "รหัสผ่าน";

"People in this conversation can see your location on the map.|Text of location NUX when user has enabled location services." = "ผู้ที่อยู่ในการสนทนานี้จะสามารถเห็นตำแหน่งที่ตั้งของคุณในแผนที่ได้";

"People you add will see all previous messages in this conversation.|warning when adding new people to a thread" = "บุคคลที่คุณเพิ่มจะเห็นข้อความก่อนหน้าในการสนทนานี้";

"Phone Number|placeholder text for phone number field" = "หมายเลขโทรศัพท์";

"Pin friends you message most|Label when users have no favorites" = "ปักหมุดเพื่อนที่คุณส่งข้อความถึงบ่อยที่สุด";

"Please check your confirmation code and try again.|alert message for incorrect confirmation code" = "โปรดตรวจสอบรหัสยืนยันและลองอีกครั้ง";

"Please check your network connection and try again.|" = "โปรดตรวจสอบการเชื่อมต่อเครือข่ายและลองอีกครั้ง";

"Please check your number and try again.|Error reported when an invalid phone number response is received from the server" = "โปรดตรวจสอบหมายเลขของคุณแล้วลองอีกครั้ง";

"Please check your number and try again.|alert message for invalid phone number" = "โปรดตรวจสอบหมายเลขของคุณแล้วลองอีกครั้ง";

"Please download the latest version of Facebook Messenger.|Notification displayed to user when a version upgrade is available" = "โปรดดาวน์โหลด Facebook Messenger เวอร์ชันล่าสุด";

"Please enter a message or attach a photo|dialog message for when user tries to send an empty message" = "โปรดป้อนข้อความหรือแนบรูปภาพ";

"Please enter a valid country code.|alert message for invalid country code" = "โปรดป้อนรหัสประเทที่ถูกต้อง";

"Please enter the email and password you use to log in to Facebook.|Invalid login alert message" = "โปรดป้อนอีเมลและรหัสผ่านที่คุณใช้เพื่อเข้าสู่ระบบ Facebook";

"Please include a description of your problem.|Message for empty feedback warning." = "โปรดใส่คำอธิบายปัญหาของคุณ";

"Please rate the quality of your call|Prompt for call quality survey" = "โปรดให้คะแนนคุณภาพการโทรของคุณ";

"Please re-login to renew your session.|Error message for expired session" = "โปรดเข้าสู่ระบบอีกครั้งเพื่อต่ออายุเซสชัน";

"Please try again|Alert message when there are no results from image search." = "โปรดลองอีกครั้ง";

"Please use a shorter conversation name.|alert message for long conversation name" = "โปรดใช้ชื่อการสนทนาที่สั้นกว่านี้";

"Privacy & Terms|text for privacy and terms button" = "ความเป็นส่วนตัวและเงื่อนไข";

"Pull Chat Heads down to the Ⓧ to hide them.|Chat head dismiss NUX body" = "ดึง Chat Heads ลงไปที่ Ⓧ เพื่อซ่อน";

"Pull down to refresh...|message for pull down to refresh" = "กดลงเพื่อรีเฟรช...";

"Push notification alerts are off.|Notice that push notifications are turned off" = "การแจ้งเตือนแบบพุชปิดอยู่";

"Push notification alerts are off.|Reminder text for when push alerts are off on the phone." = "การแจ้งเตือนแบบพุชปิดอยู่";

"Push notification sounds are off.|Reminder text for when push notification sounds are off on the phone." = "เสียงการแจ้งเตือนแบบพุชปิดอยู่";

"Push notifications are off.|Reminder text for when push notifications are off on the phone." = "การแจ้งเตือนแบบพุชปิดอยู่";

"Push up to refresh...|message for push up to refresh" = "กดขึ้นเพื่อรีเฟรช...";

"Pusheen|Name for Pusheen sticker pack" = "Pusheen";

"Quickly find your group chats here.|Body text for megaphone encourgaging users to try group chats" = "ค้นหาการแชทกลุ่มของคุณอย่างรวดเร็วที่นี่";

"Quickly find your group messages here.|Body text for megaphone encourgaging users to try group chats" = "ค้นหาข้อความกลุ่มของคุณอย่างรวดเร็วที่นี่";

"Rate %@|Alert title for asking user to rate this app." = "ให้คะแนน %1$@";

"Rate %@|Label on button prompting user to rate the app." = "ให้คะแนน %1$@";

"Reach friends wherever they are now — mobile or web.|Body of Messenger NUX page 1" = "ติดต่อเพื่อนไม่ว่าพวกเขาจะอยู่ในมือถือหรือเว็บ";

"Reach friends wherever they are now|Detail subtitle for Cross Platform NUX slide" = "ติดต่อกับเพื่อนได้ไม่ว่าจะอยู่ที่ไหน";

"Recent Stickers|Accessibility label for recently used stickers" = "สติกเกอร์ล่าสุด";

"Recent Stickers|Label shown in recent stickers tab when no recent stickers exist." = "สติกเกอร์ล่าสุด";

"Record Video|action sheet option for recording a video" = "บันทึกวิดีโอ";

"Record Voice|Button label for attaching an audio clip" = "บันทึกเสียง";

"Recorder failed to start|Error info for users saying the audio recorder failed to start." = "ไม่สามารถเริ่มโปรแกรมบันทึกเสียงได้";

"Recording cancelled|Notify user that the recording has been successfully cancelled." = "ยกเลิกการบันทึกเสียงแล้ว";

"Release to cancel recording|The instruction to user: release the record button to cancel the recording." = "ปล่อยเพื่อยกเลิกการบันทึกเสียง";

"Release to refresh...|message for releasing to refresh" = "ปล่อยปุ่มเพื่อรีเฟรช...";

"Remind Me Later|Label on button allowing the user to postpone rating the app." = "เตือนฉันในภายหลัง";

"Remove Attachment|action sheet option for removing current attachment" = "ลบสิ่งที่แนบออก";

"Remove Photo|action sheet option for removing chosen photo" = "ลบรูปภาพ";

"Remove Photo|action sheet option for removing current attachment" = "ลบรูปภาพ";

"Removing...|text for removing progress" = "กำลังลบออก...";

"Report a Problem|title for give feedback or report bug" = "รายงานปัญหา";

"Resend|Resend - Resend Button Title" = "ส่งใหม่";

"Retry|generic retry button" = "ลองใหม่";

"Ringing|Text shown on call screen while contacting another party" = "กำลังโทร";

"Save Photo|action sheet option to save photo to library" = "บันทึกรูปภาพ";

"Save photo as conversation image?|" = "บันทึกรูปภาพเป็นรูปการสนทนาหรือไม่?";

"Save|" = "บันทึก";

"Saving...|Progress text shown while saving a new image for a thread" = "กำลังบันทึก...";

"Saving...|Progress text shown while saving a new name for a thread" = "กำลังบันทึก";

"Search for More Friends…|Label at bottom of online friends list that lets user search for more friends" = "ค้นหาเพื่อนเพิ่มเติม…";

"Search to add favorites|placeholder in edit favorites search bar" = "ค้นหาเพื่อเพิ่มรายการโปรด";

"Search|placeholder in search bar" = "ค้นหา";

"Searching...|Placeholder text in a search results list that indicates a contact search is ongoing" = "กำลังค้นหา...";

"See Group Chats|Label for a button that creates a new group chat" = "ดูการแชทกลุ่ม";

"See where friends are hanging out and share your location with them. They won't see exactly where you are.|Description of NUX to encourage user to use location services." = "ดูว่าเพื่อนพบปะสังสรรค์กันที่ไหนแล้วแบ่งปันตำแหน่งที่ตั้งกับพวกเขา เพื่อนของคุณจะไม่เห็นอย่างเจาะจงว่าคุณอยู่ที่ใด";

"Seen by Everyone|Seen state text for when everyone has seen the message." = "ทุกคนดู";

"Seen by everyone|Seen state text for when everyone has seen the message." = "ทุกคนดู";

"Seen by %@ %@|Text for when a message has been seen by 1 person at a certain time or date/time. eg. (Seen by <name> <time>)" = "อ่านโดย %1$@ เมื่อ %2$@";

"Seen by %@|Text for when a message has been seen by 1 person" = "อ่านโดย %1$@";

"Seen by %@|Text for when a message has been seen by more than 1 person" = "อ่านโดย %1$@";

"Seen by:|Text for seen state header" = "คนที่ดู:";

"Seen %@ near %@|Text for when a message has been sen at a certain time (or date/time) and location e.g. (Seen 3:33 PM near Palo Alto)" = "อ่านเมื่อ %1$@ ใกล้กับ %2$@";

"Seen %@|Text for when a message has been seen at a certain time or date/time. eg. (Seen 3:33PM) or (Seen Mon 3:33PM)" = "ดู %1$@";

"Select country code|select country code text" = "เลือกรหัสประเทศ";

"Send (%i)|Send button with count in parentheses" = "ส่ง (%1$i)";

"Send Failure|dialog title for when a broadcast message fails" = "การส่งล้มเหลว";

"Send in Message|Sharing option" = "ส่งในข้อความ";

"Send to Phone, Chat and Web|Call to action for Cross Platform NUX slide" = "ส่งไปที่โทรศัพท์ แชท และเว็บ";

"Send|Nav bar send button text" = "ส่ง";

"Send|Send button" = "ส่ง";

"Send|text to show in the send button" = "ส่ง";

"Sending...|sending progress text" = "กำลังส่ง...";

"Sending…|Text used below message bubble to show send is in progress" = "กำลังส่ง…";

"Sent a message|default notification text for messages with no body text" = "ส่งข้อความแล้ว";

"Sent from Messenger|indicator that a message was sent from Messenger" = "ส่งจาก Messenger";

"Sent from email|indicator that a message was sent from email" = "ส่งจากอีเมล";

"Sent from mobile|indicator that a message was sent sent from a mobile device" = "ส่งจากมือถือ";

"Sent from web|indicator that a message was sent sent from web or chat" = "ส่งจากเว็บ";

"Sent from %@|Text used for showing the location where a message was sent from. e.g (city) or (city, state) or (city, country)." = "ส่งจาก %1$@";

"Sent %@|Text used for showing that a message has been successfully sent to the server. eg. (Published <time>)." = "ส่งไปยัง %1$@ แล้ว";

"Session Expired|Error title for expired session" = "เซสชันหมดอายุ";

"Set Facebook to ON|One of a sequence of steps instructing user to turn on location services." = "ตั้งค่า Facebook เป็น เปิด";

"Settings App > General > Location Services|Location of Location Services Settings page for before 4.3." = "การตั้งค่าแอป > ทั่วไป > บริการตำแหน่งที่ตั้ง";

"Settings App > Location Services|Location of Location Services Settings page for 4.3 or later." = "การตั้งค่าแอป > บริการตำแหน่งที่ตั้ง";

"Settings App > Privacy > Location Services|Location of Location Services Settings page for 6.0 or later." = "การตั้งค่า แอพ - ความเป็นส่วนตัว - บริการตำแหน่งที่ตั้ง";

"Settings|Accessibility label for a gear button that shows settings for chat" = "การตั้งค่า";

"Settings|Settings alert popup button" = "การตั้งค่า";

"Settings|title for settings page" = "การตั้งค่า";

"Share your location to see who.|Subtitle of mini-megaphone inside chat bar. User can see which friends are nearby after sharing his own location." = "แชร์ตำแหน่งที่ตั้งเพื่อดูว่าใคร";

"Share|Share button title" = "แชร์";

"Shared Photos|Title for section showing photos in a thread (count will follow)" = "รูปภาพที่แชร์";

"Shared a link|text for a link share" = "แชร์ลิงก์";

"Shared a photo|text for a photo share" = "แชร์รูปภาพ";

"Shared a video|text for a video share" = "แชร์วิดีโอ";

"Show keyboard|Accessibility label for sticker button in the input field when sticker input is shown" = "แสดงแป้นพิมพ์";

"Show stickers|Accessibility label for sticker button in the input field when sticker input is not shown" = "แสดงสติกเกอร์";

"Sign Up for Facebook|Sign Up - Sign Up Button Title" = "ลงทะเบียน Facebook";

"Skip|Skip - Skip Button Title" = "ข้าม";

"Something went wrong. Want to try again?|retry dialog message" = "มีบางอย่างผิดปกติ ต้องการลองอีกครั้งหรือไม่?";

"Sorry, something went wrong|Generic error message for Web browser errors" = "ขออภัย มีบางอย่างผิดปกติ";

"Standard Data Charges|Alert title that warns users their mobile carrier may charge them to use this feature" = "ค่าบริการข้อมูลมาตรฐาน";

"Standard charges apply when you load map data.|Alert message that warns users their mobile carrier may charge them for loading the map location" = "มีค่าบริการมาตรฐานเมื่อคุณโหลดข้อมูลแผนที่";

"Start Group Chats|Call to action for Group Chat NUX slide" = "เริ่มแชทแบบกลุ่ม";

"Sticker Store|Navigation bar title for sticker store view" = "Sticker Store";

"Stop attaching media|Accessibility text for button that lets user stop attaching photos or other media, as well as emoticons and emoji" = "หยุดแนบสื่อ";

"Submit|Submit button title" = "ส่ง";

"Suggestions|Suggested people to send a message to" = "แนะนำ";

"Switch Account|text for switching logged in user" = "เปลี่ยนบัญชีผู้ใช้";

"Switch to Wi-Fi to complete your call|Error case when calls not allowed over cellular data. Suggest user switch to WiFi instead." = "สลับไปใช้ Wi-Fi เพื่อโทร";

"Sync Contacts|Start contact sync button label, 15 char max" = "ซิงค์ผู้ติดต่อ";

"Sync Your Contacts|Title of the Learn More screen for the contact sync feature" = "ซิงค์ผู้ติดต่อของคุณ";

"Tag posts and photos with a location. Plus discover what's happening nearby, even when your phone is in your pocket.|Description of NUX to encourage user to use location services." = "แท็กโพสต์และรูปภาพด้วยตำแหน่งที่ตั้งแล้วค้นหาว่ามีอะไรเกิดขึ้นใกล้เคียงบ้าง แม้ว่าโทรศัพท์ของคุณจะอยู่ในกระเป๋าก็ตาม";

"Take Photo|action sheet option for taking a photo" = "ถ่ายภาพ";

"Tap General|One of a sequence of steps instructing user to turn on location services." = "แตะ ทั่วไป";

"Tap Location Services|One of a sequence of steps instructing user to turn on location services." = "แตะ บริการหาตำแหน่งที่ตั้ง";

"Tap Privacy|One of a sequence of steps instructing user to turn on location services." = "แตะ ความเป็นส่วนตัว";

"Tap \"Try Again\" to send this message.|prompt for how to resend a failed message send" = "แตะ \"ลองอีกครั้ง\" เพื่อส่งข้อความนี้";

"Tap gear to turn on chat|placeholder in search bar when offline" = "แตะรูปเฟืองเพื่อเปิดการแชท";

"Tap here to learn about your settings and why Facebook continuously needs your location.|Disclaimer text for continuous location tracking and sharing feature" = "แตะที่นี่เพื่อเรียนรู้เกี่ยวกับการตั้งค่าของคุณและเหตุผลว่าทำไม Facebook จึงต้องการตำแหน่งที่ตั้งของคุณตลอดเวลา";

"Tap the + to send photos, add s and record voice messages.|Text for Media attachment NUX" = "แตะ + เพื่อส่งรูปภาพ เพิ่ม  และบันทึกข้อความเสียง";

"Tap to return to call|Message shown on in-call bar explaining that the user may tap on it to return to the call screen" = "แตะเพื่อกลับไปยังการสนทนา";

"Tap to turn on location|Title of location NUX when user has disabled location services." = "แตะเพื่อเปิดตำแหน่งที่ตั้ง";

"Text messages can't be sent to that number.|Error reported when a phone number with an unsupported mobile carrier is on the recipients list of a message." = "ไม่สามารถส่งข้อความถึงหมายเลขนั้น";

"Text your friends for free.|The detailed info for free messenger promotion" = "ส่งข้อความถึงเพื่อนของคุณฟรี";

"Text your friends wherever they are - on their phones or on chat.|The description message to promote users for installing Facebook Messenger app" = "ส่งข้อความถึงเพื่อนไม่ว่าพวกเขาจะอยู่ที่ไหน ในโทรศัพท์หรือแชท";

"That phone number is not allowed to receive text messages.|Error reported when an unlaunched phone number is on the recipients list of a message." = "หมายเลขโทรศัพท์นั้นไม่ได้รับอนุญาตให้รับข้อความ";

"There was a problem connecting to Facebook. Please check your connection and try again.|error message for failing to connect to Facebook" = "มีปัญหาในการเชื่อมต่อกับ Facebook โปรดตรวจสอบการเชื่อมต่อของคุณแล้วลองอีกครั้ง";

"There was a problem connecting your call. Please connect to Wi-Fi and try again.|Alert body message when connection failed suggesting user switch to wifi" = "มีปัญหาเกิดขึ้นในการเชื่อมต่อการโทรของคุณ โปรดเชื่อมต่อกับ Wi-Fi แล้วลองอีกครั้ง";

"Tip: Never Miss a Message|Title for reminder to turn on push notifications" = "เคล็ดลับ: ไม่พลาดสักข้อความ";

"To accept calls, you need to update to the new version of Messenger.|Error dialog body shown when an incoming call failed because the current version is outdated" = "ในการรับสาย คุณต้องอัพเดตเป็น Messenger เวอร์ชันใหม่";

"To complete your phone number activation, please enter the activation code|" = "ในการเปิดใช้งานหมายเลขโทรศัพท์ โปรดป้อนรหัสเปิดใช้งาน";

"To include location with your messages, go to your %@.|Alert dialog instructing the user how to re-enable location permission. The variable is 'Settings App > Location Services' or 'Settings App > General > Location Services'" = "ในการรวมตำแหน่งที่ตั้งในข้อความ ให้ไปที่ %1$@ ของคุณ";

"To make calls, you need to update to the new version of Messenger.|Error dialog body. Shown when a user attempts to make a VoIP call but their version is incompatible." = "ในการโทร คุณต้องอัพเดตเป็น Messenger เวอร์ชันใหม่";

"To turn off alerts for this conversation, go to conversation settings.|User education for how to configure conversation alerts" = "ในการปิดการเตือนสำหรับการสนทนานี้ ให้ไปที่ตั้งค่าการสนทนา";

"To turn off location for all your conversations, go to your %@.|Text of location NUX when user turns off location services for the first time. The parameter is the location of the Location Services in the Settings app (ie. Settings App > Location Services)" = "ในการปิดตำแหน่งที่ตั้งสำหรับการสนทนาทั้งหมดของคุณ ให้ไปที่ %1$@ ของคุณ";

"To turn on notifications, visit iPhone Settings %@ Notifications %@ Messenger|Body of dialog telling the user how to enable push notifications on Messenger" = "ในการเปิดการแจ้งเตือน ไปที่การตั้งค่า iPhone %1$@ การแจ้ง %2$@ Messenger";

"To use this feature, go to your %@ settings and choose Location Services. Select ON for %@.|Error explanation when location services are unavailable. {name1} is the name of the current device, e.g. iPhone; {name2} is the app name." = "ในการใช้คุณสมบัตินี้ ไปที่การตั้งค่า %1$@ ของคุณแล้วเลือกบริการตำแหน่งที่ตั้ง เลือก เปิด สำหรับ %2$@";

"To use this feature, go to your %@ settings and tap Privacy, then Location Services. Select ON for %@.|Error explanation when location services are unavailable. {name1} is the name of the current device, e.g. iPhone; {name2} is the app name." = "ในการใช้คุณสมบัตินี้ ไปที่การตั้งค่า %1$@ ของคุณแล้วแตะ ความเป็นส่วนตัว จากนั้น บริการตำแหน่งที่ตั้ง เลือก เปิด สำหรับ %2$@";

"To|Accessibility label for to field in contact picker" = "ถึง";

"To:|to field in contact picker" = "ถึง:";

"Touch and hold to talk.\nRelease to send, or slide off the button to cancel.|Instruction text for holding voice record button, letting go to send, and dragging finger off to cancel message" = "สัมผัสค้างไว้เพื่อพูด\nปล่อยเพื่อส่ง หรือเลื่อนออกจากปุ่มเพื่อยกเลิก";

"Try Again|button text for resending an unsent message. this is referred to in the prompt Tap \"Try Again\" text" = "ลองอีกครั้ง";

"Turn Off Chat|Button title to let the user change their chat status from online to offline" = "ปิดการแชท";

"Turn Off Until 8am|Option to turn off alerts until 8am" = "ปิดจนถึงเวลา 8.00 น.";

"Turn Off for 1h|Option to turn off alerts for 1 hour" = "ปิดเป็นเวลา 1 ชม.";

"Turn Off|Option to turn off alerts" = "ปิด";

"Turn On Chat|Button title to let the user change their chat status from offline to online" = "เปิดการแชท";

"Turn On Location Services|Error message title when location services are unavailable." = "เปิดบริการตำแหน่งที่ตั้ง";

"Turn On Notifications|Call to action in NUX encouraging user to turn on push notifications" = "เปิดการแจ้งเตือน";

"Turn On Notifications|Title of dialog telling the user how to enable push notifications" = "เปิดการแจ้งเตือน";

"Turn On|Option to turn on alerts" = "เปิด";

"Turn On|Turn on alerts" = "เปิด";

"Turn On|button label for deferring enabling push notifications" = "เปิด";

"Turn on Push Notifications|Call to action for Push Notification NUX slide" = "เปิดการแจ้งเตือน";

"Turn on push notifications to find out when new messages arrive.|Message for reminder to turn on push notifications" = "เปิดการแจ้งเตือนเพื่อทราบเมื่อมีข้อความใหม่";

"Turns notifications on or off|Accessibility hint for Notification switch in the messenger settings panel, which lets users to turn on/off notifications" = "เปิดหรือปิดการแจ้งเตือน";

"Typing…|Text for when the other user is typing. Ends with an ellipsis (U+2026) and is lower-case." = "กำลังพิมพ์…";

"Unable to Call %@|Error dialog title. Shown when app must be updated" = "ไม่สามารถโทรไปยัง %1$@ ได้";

"Unable to Save Image|retry dialog title for setting thread image" = "ไม่สามารถบันทึกรูปภาพ";

"Unable to Send|Title for send feedback failed warning." = "ไม่สามารถส่งได้";

"Unable to add more people to the conversation. Please try again.|error message for failing to add people" = "ไม่สามารถเพิ่มบุคคลในการสนทนาได้อีก โปรดลองอีกครั้ง";

"Unable to name your conversation.|error message after setting conversation name" = "ไม่สามารถตั้งชื่อการสนทนาของคุณ";

"Unable to remove you right now.|error messages after leaving conversation" = "ไม่สามารถลบคุณออกในขณะนี้";

"Unable to save messaging favorites to Facebook|error message for failing to save messaging favorites" = "ไม่สามารถบันทึกรายการโปรดข้อความใน Facebook ได้";

"Unable to send message. Retry?|Alert text for when a message failed to send that also asks user to retry." = "ไม่สามารถส่งข้อความ ลองใหม่?";

"Unable to send message.|Alert text for when a message failed to send." = "ไม่สามารถส่งข้อความ";

"Unable to send right now.|error message for failing to send message" = "ไม่สามารถส่งในขณะนี้";

"Unpin|button title to remove user from favorites" = "เลิกปักหมุด";

"Update|Get new version now button." = "อัพเดต";

"Updating...|updating progress text" = "กำลังอัพเดต...";

"Upgrade Now|button text on alert dialog prompting user to upgrade app" = "อัพเกรดเดี๋ยวนี้";

"Use Messenger for Free|Default title for the zero rating promotion banner view at the bottom of screen." = "ใช้ Messenger ฟรี";

"View Call|Text show on button that views an incoming call" = "ดูสาย";

"View Missed Call|Text show on button that views an incoming call" = "ดูสายที่ไม่ได้รับ";

"View Timeline|Button text to go to a user's timeline" = "ดูไทม์ไลน์";

"View in Maps|action sheet option for viewing a map" = "ดูในแผนที่";

"View|Alert button that takes user to the thread where a message failed to send" = "ดู";

"We are sorry that the %@ sticker pack has failed to download, please try again later.|Description text shown in alert when downloading a sticker pack has failed" = "ขออภัยที่ชุดสติกเกอร์ %1$@ ไม่สามารถดาวน์โหลดได้ โปรดลองอีกครั้งในภายหลัง";

"We'll text you a link to confirm your number.|Confirmation information text" = "เราจะส่งลิงก์ให้คุณยืนยันหมายเลขของคุณ";

"Welcome to Messenger|Title for NUX page" = "ยินดีต้อนรับสู่ Messenger";

"Who do you want to message?|Placeholder text in To field when composing a message" = "คุณต้องการส่งข้อความถึงใคร";

"Who would you like to send this message to?|dialog message for when user tries to send message to no recipients" = "คุณต้องการส่งข้อความนี้ถึงใคร?";

"Write a blast (sends a separate message to each friend)|Placeholder text for blast message text box which helps explain how blast messages work." = "เขียนการกระจายข่าว (ส่งข้อความแยกต่างหากไปยังเพื่อนแต่ละคน)";

"Write a broadcast (sends a separate message to each friend)|Placeholder text for broadcast message text box which helps explain how broadcast messages work." = "เขียนการกระจายข่าว (ส่งข้อความแยกต่างหากไปยังเพื่อนแต่ละคน)";

"Write a message...|Placeholder text to suggest writing a message" = "เขียนข้อความ...";

"You can call %@ over Wi-Fi. Please turn on Wi-Fi in your phone settings.|Error message when user tries to initiate a call if wifi is required" = "คุณสามารถโทรถึง %1$@ ผ่าน Wi-Fi ได้ โปรดเปิด Wi-Fi ในการตั้งค่าโทรศัพท์ของคุณ";

"You can manage your data in your privacy settings.|Explanation to let user know he can manage his data in privacy settings." = "คุณสามารถจัดการข้อมูลของคุณในการตั้งค่าความเป็นส่วนตัวของคุณ";

"You missed a call from %@|Message notifying user of a missed call from Friend" = "คุณไม่ได้รับสายจาก %1$@";

"You will get an SMS or email shortly with a code to use for logging in.|message in login approval dialog" = "อีกสักครู่คุณจะได้รับ SMS หรืออีเมลที่มีรหัสสำหรับใช้เข้าสู่ระบบ";

"You won't find out when you've received a message.|Body of dialog encouraging the user to enable push notifications" = "คุณจะไม่ทราบเมื่อคุณได้รับข้อความ";

"You|String for you, the user" = "คุณ";

"You're about to leave Messenger. Standard data charges may apply.|Alert message that warns users their mobile carrier may charge them due to redirect out of Messenger" = "คุณกำลังจะออกจาก Messenger อาจมีค่าบริการข้อมูลมาตรฐาน";

"Your Stickers|Segment button label for downloaded stickers" = "สติกเกอร์ของคุณ";

"Your friend can't receive calls right now|Text informing user that call button is disabled because his or her friend is not available" = "เพื่อนของคุณไม่สามารถรับสายได้ในขณะนี้";

"Your friend is nearby at a coffee shop.|Example of what user can know after sharing location." = "เพื่อนของคุณอยู่ใกล้ๆ ในร้านกาแฟ";

"Your friend recommended a restaurant nearby.|Example of what user can know after sharing location." = "เพื่อนของคุณแนะนำร้านอาหารใกล้เคียง";

"Your friend took a photo nearby.|Example of what user can know after sharing location." = "เพื่อนของคุณถ่ายภาพอยู่ใกล้เคียง";

"Your message failed to send to one or more of the recipients.|dialog content for when a broadcast message fails." = "ไม่สามารถส่งข้อความของคุณไปยังผู้รับอย่างน้อยหนึ่งคนได้";

"Your message failed to send to one or more of the recipients.\n\n%@|dialog content for when a broadcast message fails, appended with a localized server error message. The server error message should appear on its own line and will generally be its own sentence, such as 'The internet connection appears to be offline.'" = "ไม่สามารถส่งข้อความของคุณไปยังผู้รับอย่างน้อยหนึ่งคนได้\n\n%1$@";

"Your message was not sent.|text shown when a message failed to send" = "ข้อความของคุณไม่ถูกส่ง";

"Your messages were not sent.|text shown when more than 1 message failed to send" = "ข้อความของคุณไม่ถูกส่ง";

"[[content]] [[cta]]|The i18n format for zero rating banner" = "[[content]] [[cta]]";

"·|Dot separator between title and count label" = "·";

"…|Ellipsis (U+2026) used to represent a chat message that is currently being written" = "…";

"active 1d ago|indicator that a user was active 1 day ago" = "ใช้งานเมื่อ 1 วันที่แล้ว";

"active 1h ago|indicator that a user was active 1 hour ago" = "ใช้งานเมื่อ 1 ชั่วโมงที่แล้ว";

"active 1m ago|indicator that a user was active 1 minute ago" = "ใช้งานเมื่อ 1 นาทีที่แล้ว";

"active now|indicator that a user is currently active, on web or mobile" = "ใช้งานอยู่ในขณะนี้";

"active on mobile %@ ago|presences status for being active on mobile a relative time ago" = "ใช้งานบนมือถือเมื่อ %1$@ ที่แล้ว";

"active on mobile|presences status for being active on mobile" = "ใช้งานบนมือถือ";

"active %id ago|indicator that a user was active 2+ days ago" = "ใช้งานเมื่อ %1$i วันที่แล้ว";

"active %ih ago|indicator that a user was active 2+ hours ago" = "ใช้งานเมื่อ %1$i ชั่วโมงที่แล้ว";

"active %im ago|indicator that a user was active 2+ minute ago" = "ใช้งานเมื่อ %1$i นาทีที่แล้ว";

"active %@ ago|presences status for being active a relative time ago" = "ใช้งานเมื่อ %1$@ ที่แล้ว";

"error|A short message for audio play error" = "ข้อผิดพลาด";

"is calling|text below the caller's name when they are calling" = "กำลังโทรหา";

"is typing…|text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case. name appears on left" = "กำลังพิมพ์…";

"on mobile|presences status for being available on mobile" = "บนมือถือ";

"online %@ ago|presences status for being online on the web a relative time ago" = "ออนไลน์ %1$@ ที่แล้ว";

"online|presences status for being online on the web" = "ออนไลน์";

"typing…|text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case." = "กำลังพิมพ์…";

"%d more friends nearby...|Additional nearby friend results available to show" = "เพื่อน %1$d คนอยู่ใกล้เคียง...";

"%d of %d|Title on photo viewer screen showing which photo is currently displayed. eg. 2 of 3" = "%1$d จาก %2$d";

"%i days|text to show user was online/active N days ago (don't abbrev)" = "%1$i วัน";

"%i hours|text to show user was online/active N hours ago (don't abbrev)" = "%1$i ชั่วโมง";

"%i minutes|text to show user was online/active N minutes ago (don't abbrev)" = "%1$i นาที";

"%i people found, %i matched|Explanation of how many contacts have been imported" = "พบ %1$i คน ตรงกัน %2$i คน";

"%id|short indicator that a user was active 2+ days ago" = "%1$i วัน";

"%ih|short indicator that a user was active 2+ hours ago" = "%1$i ชม.";

"%im|short indicator that a user was active 2+ minute ago" = "%1$i นาที";

"%@  •  %@|Seen state text for a user in a group detail page. eg. (name <bullet-character> time)" = "%1$@  •  %2$@";

"%@ and %@ use Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@ และ %2$@ ใช้ Facebook Messenger";

"%@ and %@|String for two user names who are participants on a thread" = "%1$@ และ %2$@";

"%@ hundred-million|Shortened number whose value is larger than 100,000,000. Only used in languages that have a word for 'hundred million' but not for 'billion'. {name1}: a whole number or a fraction up to one decimal place (e.g. 17 or 17.1)" = "%1$@ ร้อยล้าน";

"%@ is calling|Message notifying of an incoming call. First parameter is the name of the caller" = "%1$@ กำลังโทร";

"%@ is in another call|End call message notifying caller that callee is unavailable. First parameter is the name of the callee" = "%1$@ กำลังอยู่ในสายอื่น";

"%@ is nearby at a coffee shop.|Example of what user can know after sharing location. E.g. Mark is nearby at a coffee shop." = "%1$@ อยู่ใกล้ๆ ในร้านกาแฟ";

"%@ is not available|End call message notifying caller that callee is unavailable. First parameter is the name of the callee" = "%1$@ ไม่ว่าง";

"%@ is on messenger|Accessibility label for a profile photo showing the user that one of their friends uses Messenger" = "%1$@ อยู่ใน Messenger";

"%@ is typing…|string format text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case. name appears on left" = "%1$@ กำลังพิมพ์…";

"%@ recommended a restaurant nearby.|Example of what user can know after sharing location. E.g. Linda recommended a restaurant nearby." = "%1$@ แนะนำร้านอาหารใกล้เคียง";

"%@ said %@|Accessibility label for a message, will be announced to blind users. First placeholder is for sender name, second placeholder is for the message he/she sent." = "%1$@ พูดว่า %2$@";

"%@ ten-thousand|Shortened number whose value is between 10,000 and 99,999,999. Only used for languages that have a word for 'ten thousand' but not for 'million'. {name1}: a whole number or a fraction up to one decimal place (e.g. 17 or 17.1)" = "%1$@ หมึ่น";

"%@ took a photo nearby.|Example of what user can know after sharing location. E.g. Anna took a photo nearby." = "%1$@ ถ่ายภาพอยู่ใกล้เคียง";

"%@ tried to call you|Error dialog title shown when an incoming voice call can't be received" = "%1$@ ได้พยายามโทรถึงคุณ";

"%@ uses Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@ ใช้ Facebook Messenger";

"%@|Name of a person (used both standalone and in lists). Add honorifics (-san, etc.) if appropriate." = "%1$@";

"%@, %d new messages|new messages input format" = "%1$@ %2$d ข้อความใหม่";

"%@, %i more|List of user names and X more if the list is truncated at N names." = "%1$@, อีก %2$i";

"%@, %@ and %@ use Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@ และ %3$@ ใช้ Facebook Messenger";

"%@, %@, %@ and 1 other friend use Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@, %3$@ และเพื่อนอีก 1 คนใช้ Messenger";

"%@, %@, %@ and %i other friends use Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@, %3$@ และเพื่อนอีก %4$i คนใช้ \nMessenger";

"%@: %@|Localized contact label: phone number (note colon separator)" = "%1$@: %2$@";

"%@B|Shortened number whose value is larger than 1,000,000,000. B stands for 'billion'. {name1}: a whole number or a fraction up to one decimal place (e.g. 17 or 17.1)" = "%1$@ พันล้าน";

"%@K|Shortened number whose value is between 1,000 and 999,999. K stands for 'thousand''. {name1}: a whole number or a fraction up to one decimal place (e.g. 17 or 17.1)" = "%1$@ พัน";

"%@M|Shortened number whose value is between 1,000,000 and 999,999,999. M stands for 'mega' or 'million'. {name1}: a whole number or a fraction up to one decimal place (e.g. 17 or 17.1)" = "%1$@ ล้าน";

"%@…|a string that has been shortened adding ellipsis (unicode 2026)" = "%1$@…";

"%u Friends Nearby|Title of mini-megaphone inside chat bar. E.g. 5 Friends Nearby" = "เพื่อน %1$u คนอยู่ใกล้เคียง";

"%u of your friends are sharing their location with you.|Message to let user know how many of his friends are sharing location." = "เพื่อนของคุณ %1$u คนกำลังแชร์ตำแหน่งที่ตั้งของพวกเขากับคุณ";

"%u photo attached|Accessiblity text for a single photo" = "แนบรูปภาพ %1$u รูป";

"%u photos attached|Accessibility text for a photo set" = "แนบรูปภาพ %1$u รูป";

